---
kind: property
id: P:Autodesk.Revit.DB.Analysis.Polyloop.Centroid
source: html/21844486-1db3-dc28-4993-c99dbe4b2172.htm
---
# Autodesk.Revit.DB.Analysis.Polyloop.Centroid Property

The polygon centroid.

## Syntax (C#)
```csharp
public XYZ Centroid { get; }
```